In [1]:
import pandas as pd

In [8]:
#df1 = pd.DataFrame({'NOMBRE':['Jose', 'Max'],'CARRERA':['Economia', 'Arquitectura'],'EDAD':[23,26]}).set_index('NOMBRE')
#df2 = pd.DataFrame({'NOMBRE':['Aurora', 'Maria'],'CARRERA':['Medicina', 'Informatica'],'EDAD':[22,28]}).set_index('NOMBRE')

df1 = pd.DataFrame({'NOMBRE':['Jose', 'Max'],'CARRERA':['Economia', 'Arquitectura'],'EDAD':[23,26]})
df2 = pd.DataFrame({'NOMBRE':['Aurora', 'Maria'],'CARRERA':['Medicina', 'Informatica'],'EDAD':[22,28]})

In [9]:
df = pd.concat([df1, df2])

   NOMBRE       CARRERA  EDAD
0    Jose      Economia    23
1     Max  Arquitectura    26
0  Aurora      Medicina    22
1   Maria   Informatica    28

In [11]:
df = df.reset_index(drop = True)

In [12]:
df

   NOMBRE       CARRERA  EDAD
0    Jose      Economia    23
1     Max  Arquitectura    26
2  Aurora      Medicina    22
3   Maria   Informatica    28